const columns: any = [
  {
    title: '序号',
    dataIndex: '1',
    key: '1',
    render: (text: any, record: any, index: number) => index + 1,
    align: 'center',
    width: 50
  },
  {
    title: '护理单元',
    width: 220,
    dataIndex: 'wardName',
    align: 'left',
    key: '护理单元'
  },
  {
    title: '实际开放床位数',
    dataIndex: 'actualOpenBeds',
    align: 'center',
    width: 140,
    key: '实际开放床位数'
  },
  {
    title: '实际配备护士数',
    dataIndex: 'actualNurseCount',
    align: 'center',
    width: 140,
    key: '实际配备护士数'
  },
  {
    title: '实际床护比',
    dataIndex: 'actualBedNurseRatio',
    align: 'center',
    width: 140,
    key: '实际床护比'
  },
  {
    title: '目标床护比',
    dataIndex: 'targeBedNurseRatio',
    align: 'center',
    width: 140,
    key: '目标床护比'
  },
  {
    title: '需补充护士人数',
    dataIndex: 'nurseToReplenish',
    align: 'center',
    width: 140
  }
]

const dataSource = [
  {
    key: 1,
    护理单元: '五官科护理单元',
    实际开放床位数: 43,
    实际配备护士数: 10,
    实际床护比: 0.23,
    目标床护比: 0.3,
    需补充护士人数: 3
  },
  {
    key: 2,
    护理单元: '关节护理单元',
    实际开放床位数: 72,
    实际配备护士数: 23,
    实际床护比: 0.32,
    目标床护比: 0.4,
    需补充护士人数: 2
  },
  {
    key: 3,
    护理单元: '普外科护理单元',
    实际开放床位数: 86,
    实际配备护士数: 34,
    实际床护比: 0.4,
    目标床护比: 0.3,
    需补充护士人数: 3
  },
  {
    key: 4,
    护理单元: '泌尿外科护理单元',
    实际开放床位数: 68,
    实际配备护士数: 26,
    实际床护比: 0.38,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 5,
    护理单元: '创伤骨科护理单元',
    实际开放床位数: 123,
    实际配备护士数: 48,
    实际床护比: 0.39,
    目标床护比: 0.4,
    需补充护士人数: 0
  },
  {
    key: 6,
    护理单元: '肾内科护理单元',
    实际开放床位数: 56,
    实际配备护士数: 16,
    实际床护比: 0.29,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 7,
    护理单元: '脊柱科护理单元',
    实际开放床位数: 102,
    实际配备护士数: 45,
    实际床护比: 0.44,
    目标床护比: 0.3,
    需补充护士人数: 4
  },
  {
    key: 8,
    护理单元: '呼吸科护理单元',
    实际开放床位数: 64,
    实际配备护士数: 24,
    实际床护比: 0.38,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 9,
    护理单元: '儿科护理单元',
    实际开放床位数: 87,
    实际配备护士数: 34,
    实际床护比: 0.39,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 10,
    护理单元: '新生儿科护理单元',
    实际开放床位数: 65,
    实际配备护士数: 28,
    实际床护比: 0.43,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 11,
    护理单元: '心内科护理单元',
    实际开放床位数: 45,
    实际配备护士数: 19,
    实际床护比: 0.42,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 12,
    护理单元: '产科护理单元',
    实际开放床位数: 68,
    实际配备护士数: 34,
    实际床护比: 0.5,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 13,
    护理单元: '妇科护理单元',
    实际开放床位数: 100,
    实际配备护士数: 36,
    实际床护比: 0.36,
    目标床护比: 0.3,
    需补充护士人数: 0
  },
  {
    key: 14,
    护理单元: '手术室',
    实际开放床位数: 12,
    实际配备护士数: 25,
    实际床护比: 2.08,
    目标床护比: 2,
    需补充护士人数: 0
  },
  {
    key: 15,
    护理单元: '合计',
    实际开放床位数: 991,
    实际配备护士数: 402,
    实际床护比: 0.41,
    目标床护比: 0.4,
    需补充护士人数: 12
  }
]

export const 床护比统计 = { dataSource, columns }
