const columns: any = [
  {
    title: '序号',
    dataIndex: '1',
    key: '1',
    render: (text: any, record: any, index: number) => index + 1,
    align: 'center',
    width: 50
  },
  {
    title: '护理单元',
    dataIndex: 'wardName',
    align: 'center',
    key: '护理单元',
    width: 160
  },
  {
    title: 'A班',
    // width: 210,
    children: [
      {
        title: '患者数',
        dataIndex: 'patientCount_A',
        align: 'center',
        key: 'A班患者数',
        width: 70
      },
      {
        title: '护士数',
        dataIndex: 'nurseCount_A',
        align: 'center',
        key: 'A班护士数',
        width: 70
      },
      {
        title: '护患比',
        dataIndex: 'pNRatio_A',
        align: 'center',
        key: 'A班护患比',
        width: 70
      }
    ]
  },
  {
    title: 'P班',
    // width: 210,
    children: [
      {
        title: '患者数',
        dataIndex: 'patientCount_P',
        align: 'center',
        key: 'P班患者数',
        width: 70
      },
      {
        title: '护士数',
        dataIndex: 'nurseCount_P',
        align: 'center',
        key: 'P班护士数',
        width: 70
      },
      {
        title: '护患比',
        dataIndex: 'pNRatio_P',
        align: 'center',
        key: 'P班护患比',
        width: 70
      }
    ]
  },
  {
    title: 'N班',
    // width: 210,
    children: [
      {
        title: '患者数',
        dataIndex: 'patientCount_N',
        align: 'center',
        key: 'N班患者数',
        width: 70
      },
      {
        title: '护士数',
        dataIndex: 'nurseCount_N',
        align: 'center',
        key: 'N班护士数',
        width: 70
      },
      {
        title: '护患比',
        dataIndex: 'pNRatio_N',
        align: 'center',
        key: 'N班护患比',
        width: 70
      }
    ]
  },
  {
    title: '每天平均护患比',
    dataIndex: 'pNRatio_avg',
    align: 'center',
    key: '每天平均护患比'
  }
]

const dataSource = [
  {
    key: 11,
    护理单元: '五官科护理单元',
    患者数: 126,
    护士数: 28,
    A班患者数: 42,
    A班护士数: 10,
    A班护患比: '1 : 4.2',
    P班患者数: 42,
    P班护士数: 4,
    P班护患比: '1 : 10.5',
    N班患者数: 42,
    N班护士数: 4,
    N班护患比: '1 : 10.5',
    每天平均护患比: '1 : 4.2'
  },
  {
    key: 25,
    护理单元: '关节护理单元',
    患者数: 195,
    护士数: 47,
    A班患者数: 65,
    A班护士数: 23,
    A班护患比: '1 : 2.83',
    P班患者数: 65,
    P班护士数: 12,
    P班护患比: '1 : 5.42',
    N班患者数: 65,
    N班护士数: 12,
    N班护患比: '1 : 5.42',
    每天平均护患比: '1 : 2.83'
  },
  {
    key: 26,
    护理单元: '普外科护理单元',
    患者数: 246,
    护士数: 62,
    A班患者数: 82,
    A班护士数: 34,
    A班护患比: '1 : 2.41',
    P班患者数: 82,
    P班护士数: 14,
    P班护患比: '1 : 5.86',
    N班患者数: 82,
    N班护士数: 14,
    N班护患比: '1 : 5.86',
    每天平均护患比: '1 : 2.41'
  },
  {
    key: 31,
    护理单元: '泌尿外科护理单元',
    患者数: 126,
    护士数: 28,
    A班患者数: 42,
    A班护士数: 10,
    A班护患比: '1 : 4.2',
    P班患者数: 42,
    P班护士数: 4,
    P班护患比: '1 : 10.5',
    N班患者数: 42,
    N班护士数: 4,
    N班护患比: '1 : 10.5',
    每天平均护患比: '1 : 4.2'
  },
  {
    key: 234,
    护理单元: '创伤骨科护理单元',
    患者数: 195,
    护士数: 47,
    A班患者数: 65,
    A班护士数: 23,
    A班护患比: '1 : 2.83',
    P班患者数: 65,
    P班护士数: 12,
    P班护患比: '1 : 5.42',
    N班患者数: 65,
    N班护士数: 12,
    N班护患比: '1 : 5.42',
    每天平均护患比: '1 : 2.83'
  },
  {
    key: 234321,
    护理单元: '心内科护理单元',
    患者数: 126,
    护士数: 28,
    A班患者数: 42,
    A班护士数: 10,
    A班护患比: '1 : 4.2',
    P班患者数: 42,
    P班护士数: 4,
    P班护患比: '1 : 10.5',
    N班患者数: 42,
    N班护士数: 4,
    N班护患比: '1 : 10.5',
    每天平均护患比: '1 : 4.2'
  },
  {
    key: 22342432,
    护理单元: '产科护理单元',
    患者数: 195,
    护士数: 47,
    A班患者数: 65,
    A班护士数: 23,
    A班护患比: '1 : 2.83',
    P班患者数: 65,
    P班护士数: 12,
    P班护患比: '1 : 5.42',
    N班患者数: 65,
    N班护士数: 12,
    N班护患比: '1 : 5.42',
    每天平均护患比: '1 : 2.83'
  },
  {
    key: 2234,
    护理单元: '肾内科护理单元',
    患者数: 246,
    护士数: 62,
    A班患者数: 82,
    A班护士数: 34,
    A班护患比: '1 : 2.41',
    P班患者数: 82,
    P班护士数: 14,
    P班护患比: '1 : 5.86',
    N班患者数: 82,
    N班护士数: 14,
    N班护患比: '1 : 5.86',
    每天平均护患比: '1 : 2.41'
  },
  {
    key: 1654,
    护理单元: '脊柱科护理单元',
    患者数: 126,
    护士数: 28,
    A班患者数: 42,
    A班护士数: 10,
    A班护患比: '1 : 4.2',
    P班患者数: 42,
    P班护士数: 4,
    P班护患比: '1 : 10.5',
    N班患者数: 42,
    N班护士数: 4,
    N班护患比: '1 : 10.5',
    每天平均护患比: '1 : 4.2'
  },
  {
    key: 2123213,
    护理单元: '妇科护理单元',
    患者数: 246,
    护士数: 62,
    A班患者数: 82,
    A班护士数: 34,
    A班护患比: '1 : 2.41',
    P班患者数: 82,
    P班护士数: 14,
    P班护患比: '1 : 5.86',
    N班患者数: 82,
    N班护士数: 14,
    N班护患比: '1 : 5.86',
    每天平均护患比: '1 : 2.41'
  },
  {
    key: 21234,
    护理单元: '呼吸科护理单元',
    患者数: 195,
    护士数: 47,
    A班患者数: 65,
    A班护士数: 23,
    A班护患比: '1 : 2.83',
    P班患者数: 65,
    P班护士数: 12,
    P班护患比: '1 : 5.42',
    N班患者数: 65,
    N班护士数: 12,
    N班护患比: '1 : 5.42',
    每天平均护患比: '1 : 2.83'
  },
  {
    key: 4232,
    护理单元: '儿科护理单元',
    患者数: 246,
    护士数: 62,
    A班患者数: 82,
    A班护士数: 34,
    A班护患比: '1 : 2.41',
    P班患者数: 82,
    P班护士数: 14,
    P班护患比: '1 : 5.86',
    N班患者数: 82,
    N班护士数: 14,
    N班护患比: '1 : 5.86',
    每天平均护患比: '1 : 2.41'
  },
  {
    key: 234232,
    护理单元: '新生儿科护理单元',
    患者数: 246,
    护士数: 62,
    A班患者数: 82,
    A班护士数: 34,
    A班护患比: '1 : 2.41',
    P班患者数: 82,
    P班护士数: 14,
    P班护患比: '1 : 5.86',
    N班患者数: 82,
    N班护士数: 14,
    N班护患比: '1 : 5.86',
    每天平均护患比: '1 : 2.41'
  },
  {
    key: 2341324,
    护理单元: '手术室',
    患者数: 6,
    护士数: 33,
    A班患者数: 2,
    A班护士数: 25,
    A班护患比: '1 : 0.08',
    P班患者数: 2,
    P班护士数: 4,
    P班护患比: '1 : 0.5',
    N班患者数: 2,
    N班护士数: 4,
    N班护患比: '1 : 0.5',
    每天平均护患比: '1 : 0.08'
  },
  {
    key: 2123,
    护理单元: '合计',
    患者数: 6,
    护士数: 33,
    A班患者数: 891,
    A班护士数: 402,
    A班护患比: '1 : 2.22',
    P班患者数: 891,
    P班护士数: 204,
    P班护患比: '1 : 4.37',
    N班患者数: 891,
    N班护士数: 204,
    N班护患比: '1 : 4.37',
    每天平均护患比: '1 : 4.22'
  }
]

export const 护患比统计 = { dataSource, columns }
