const columns: any = [
  {
    title: '序号',
    dataIndex: '1',
    key: '1',
    render: (text: any, record: any, index: number) => index + 1,
    align: 'center',
    width: 50
  },
  {
    title: '护理单元',
    dataIndex: 'wardName',
    key: '护理单元',
    align: 'center'
  },
  {
    title: '失禁患者发生失禁性皮炎人数',
    dataIndex: 'iad_count',
    key: '失禁患者发生失禁性皮炎人数',
    align: 'center'
  },
  {
    title: '住院患者总人数',
    dataIndex: 'patient_count',
    key: '住院患者总人数',
    align: 'center'
  },
  {
    title: '发生率(%)',
    dataIndex: 'accident_ratio',
    key: '发生率(%)',
    align: 'center'
  }
]

const dataSource = [
  {
    key: 1,
    护理单元: '神经内科护理单元',
    失禁患者发生失禁性皮炎人数: 6,
    住院患者总人数: 0,
    '发生率(%)': 0
  },
  {
    key: 2,
    护理单元: '五官科护理单元',
    失禁患者发生失禁性皮炎人数: 8,
    住院患者总人数: 0,
    '发生率(%)': 0
  },
  {
    key: 3,
    护理单元: '神经外科护理单元',
    失禁患者发生失禁性皮炎人数: 15,
    住院患者总人数: 3,
    '发生率(%)': 33.33
  },
  {
    key: 4,
    护理单元: '肾内科护理单元',
    失禁患者发生失禁性皮炎人数: 10,
    住院患者总人数: 1,
    '发生率(%)': 10
  },
  {
    key: 5,
    护理单元: '泌尿外科护理单元',
    失禁患者发生失禁性皮炎人数: 18,
    住院患者总人数: 2,
    '发生率(%)': 9
  },
  {
    key: 6,
    护理单元: '妇科护理单元',
    失禁患者发生失禁性皮炎人数: 25,
    住院患者总人数: 2,
    '发生率(%)': 7
  },
  {
    key: 7,
    护理单元: '产科护理单元',
    失禁患者发生失禁性皮炎人数: 10,
    住院患者总人数: 2,
    '发生率(%)': 20
  },
  {
    key: 8,
    护理单元: '关节外科护理单元',
    失禁患者发生失禁性皮炎人数: 10,
    住院患者总人数: 1,
    '发生率(%)': '10'
  },
  {
    key: 9,
    护理单元: '创骨护理单元',
    失禁患者发生失禁性皮炎人数: 12,
    住院患者总人数: 1,
    '发生率(%)': 8
  },
  {
    key: 10,
    护理单元: '合计',
    失禁患者发生失禁性皮炎人数: 112,
    住院患者总人数: 9,
    '发生率(%)': 9
  }
]

export const 排便失禁患者失禁性皮炎发生率 = { dataSource, columns }
