const columns: any = [
  {
    title: '序号',
    dataIndex: '1',
    key: '1',
    render: (text: any, record: any, index: number) => index + 1,
    align: 'center',
    width: 50
  },
  {
    title: '护理单元',
    dataIndex: '护理单元',
    key: '护理单元',
    width:180,
    align: 'center'
  },
  {
    title: '检查查对制度的总条款数',
    dataIndex: '检查查对制度的总条款数',
    key: '检查查对制度的总条款数',
    width:180,
    align: 'center'
  },
  {
    title: '查对制度不合格条款数',
    dataIndex: '查对制度不合格条款数',
    key: '查对制度不合格条款数',
    width:180,
    align: 'center'
  },
  {
    title: '不合格率(%)',
    dataIndex: '不合格率(%)',
    key: '不合格率(%)',
    width:120,
    align: 'center'
  }
]

const dataSource = [
  {
    key: 1,
    护理单元: '神经内科护理单元',
    检查查对制度的总条款数: 6,
    查对制度不合格条款数: 0,
    '不合格率(%)': 0
  },
  {
    key: 2,
    护理单元: '五官科护理单元',
    检查查对制度的总条款数: 8,
    查对制度不合格条款数: 0,
    '不合格率(%)': 0
  },
  {
    key: 3,
    护理单元: '神经外科护理单元',
    检查查对制度的总条款数: 15,
    查对制度不合格条款数: 3,
    '不合格率(%)': 33.33
  },
  {
    key: 4,
    护理单元: '肾内科护理单元',
    检查查对制度的总条款数: 10,
    查对制度不合格条款数: 1,
    '不合格率(%)': 10
  },
  {
    key: 5,
    护理单元: '泌尿外科护理单元',
    检查查对制度的总条款数: 18,
    查对制度不合格条款数: 2,
    '不合格率(%)': 9
  },
  {
    key: 6,
    护理单元: '妇科护理单元',
    检查查对制度的总条款数: 25,
    查对制度不合格条款数: 2,
    '不合格率(%)': 7
  },
  {
    key: 7,
    护理单元: '产科护理单元',
    检查查对制度的总条款数: 10,
    查对制度不合格条款数: 2,
    '不合格率(%)': 20
  },
  {
    key: 8,
    护理单元: '关节外科护理单元',
    检查查对制度的总条款数: 10,
    查对制度不合格条款数: 1,
    '不合格率(%)': '10'
  },
  {
    key: 9,
    护理单元: '创骨护理单元',
    检查查对制度的总条款数: 12,
    查对制度不合格条款数: 1,
    '不合格率(%)': 8
  },
  {
    key: 10,
    护理单元: '合计',
    检查查对制度的总条款数: 112,
    查对制度不合格条款数: 9,
    '不合格率(%)': 9
  }
]

export const 查对制度落实合格率 = { dataSource, columns }
